// let distance = 617.54
// const login = "mango935"
// const isOnline = true
// console.log(typeof distance);
// console.log(typeof login);
// console.log(typeof isOnline);
//^ ===================================================================================================================
// const x = 8;
// const y = 5;
// console.log(x % y);
//^ ====================================================================================================================
//? Магазин з продажу ремонтних дроїдів готовий до відкриття, залишилося написати скрипт для їх замовлення.Оголоси змінні та присвой їм відповідні значення:
//? pricePerDroid - ціна одного дроїда, значення 800
//? orderedQuantity - кількість дроїдів у замовленні, значення 6
//? deliveryFee - вартість доставки, значення 50
//? totalPrice - загальна сума замовлення до сплати(ціна одного дроїда помножена на кількість дроїдів у замовленні, плюс вартість доставки)
//? message - повідомлення про стан замовлення у форматі "You ordered droids worth <total price> credits"
// const pricePerDroid = 800;
// const orderedQuantity = 6;
// const deliveryFee = 50;
// const totalPrice = (pricePerDroid * orderedQuantity) + deliveryFee;
// const message = `You ordered droids worth ${totalPrice} credits`
// console.log(message);
//^ ===================================================================================================================
// const username = "Poly";
// const username = "Harambe";
// const username = "Billy";
// const username = "Joe";
// const message = `Username ${username} is ${username.length} characters long`
// console.log(message);
//^ ===================================================================================================================
//! Оголошення функції

//^ Оголошення функції має таку структуру:

// Ключове слово function - "function"
// Ім'я функції — це дієслово, що відповідає на питання "Що зробити?" - "doStuff"
// Пара круглих дужок()
// Тіло функції у фігурних дужках {}

// function doStuff() {
//     // Тіло функції
//     console.log('Log inside multiply function'); - "Що зробити?"
// }
// doStuff();
//^ ===================================================================================================================

// Функція add повинна вміти додавати три числа і виводити результат у консоль.
// Оголоси для функції add три параметри: a, b і c, які будуть отримувати значення з аргументів, під час її виклику.
// Доповни console.log() таким чином, щоб він логував рядок "Addition result equals <result>",
// де < result > - це сума переданих чисел.

// function add(a, b, c) {
//     const result = a + b + c;
//     console.log(`Addition result equals ${result}`);
// }
// add(15, 27, 10);
// add(10, 20, 30);
// add(5, 10, 15);
//^ ===================================================================================================================

// Оператор return використовується для повернення значення з тіла функції назад у код, у місце її виклику.

// function multiply(x, y, z) { // Оголошуємо функцію multiply з трьома параметрами: x, y, z
//     const product = x * y * z; // Обчислюємо добуток трьох переданих чисел і зберігаємо його в змінній product
//     // Повертаємо результат виразу множення
//     return product;
// }

// // Викликаємо функцію multiply з аргументами 2, 3, 5 і зберігаємо результат у змінній result
// const result = multiply(2, 3, 5);
// console.log(result); // Виводимо результат (добуток) у консоль

//! Щоб уникнути оголошення зайвої змінної в тілі функції, можна відразу ж повертати результат виразу.
// Так, немає необхідності створювати окрему змінну для зберігання результату виразу.

// function multiply(x, y, z) {
//     return x * y * z;
// }
// const result = multiply(2, 3, 5);
// console.log(result);

//^ ===================================================================================================================
// Функція makeMessage(name, price) створює і повертає повідомлення про покупку.
// Вона оголошує два параметри, значення яких будуть задаватися під час її виклику.
// name - назва товару
// price - ціна товару
// Доповни код функції таким чином, щоб вона повертала рядок "You picked <product name>, price per item is <product price> credits",
// де < product name > і < product price > - це значення параметрів name і price.
// Дуже зручно зробити цей рядок з використанням синтаксису шаблонних рядків.
// function makeMessage(name, price) {
//     return `You picked ${name}, price per item is ${price} credits`
// };
// console.log(makeMessage('Radar', 6150))

//^ ===================================================================================================================
// Оголоси функцію calculateTotalPrice, яка рахує загальну суму покупки.
// Вона приймає два параметри, значення яких будуть задаватися під час її виклику.
//  orderedQuantity - перший параметр, кількість одиниць товару в замовленні;
// pricePerItem - другий параметр, ціна одиниці товару.
// Функція повинна повертати загальну суму покупки - результат множення кількості товарів на ціну одного.

// function calculateTotalPrice(orderedQuantity, pricePerItem) {
//     return orderedQuantity * pricePerItem
// }

//^ ===================================================================================================================


