//~ВЛАСТИВОСТІ

// Уяви автомат із продажу кави. Клієнт може обрати каву з цукром або без, з молоком,
// шоколадом або апельсиновим соком —
//! усе це властивості кави.

// Залежно від необхідної властивості, кава буде готуватися різними методами
// — певні рецепти вимагатимуть операції “додати цукор” або “додати молоко”, інші — ні.
//! Це різні методи.

// Так само у програмуванні.
// Дані мають набір властивостей і методів, до яких можна звертатися в коді.
// Цей набір називається інтерфейсом.Використання властивостей і методів дозволяє нам отримувати
// інформацію про сутності та виконувати операції з ними.
// У попередніх розділах ми вже познайомилися з властивостями.
// Щоб добре розрізняти властивості та методи, варто згадати,
// що властивості — це описові характеристики сутності.
// У прикладі з кавою — це колір, кількість цукру, температура.
// Наприклад, у програмуванні рядок має властивість (length),
// яка повертає кількість символів у рядку.
// Для доступу до властивості використовується синтаксис із крапкою:
// (objectName.property)
// Щоб отримати довжину рядка, використовується властивість length:

// const message = "JavaScript is awesome";
// console.log(message.length); // 21

//^====================================================================================================

// Функція normalizeInput(input, to) оголошує два параметри:
// input - рядок, який потрібно привести до певного регістру
// to - рядок с двома можливими значеннями: "upper" або "lower",
//     що вказують до якого регістру потрібно привести значення input
// Доповни код функції таким чином, щоб:
// Якщо значення параметра to — це рядок "upper", то функція
//  повертала копію рядка input, але у верхньому регістрі
// В іншому разі, функція повертала копію рядка inputу нижньому регістрі

// function normalizeInput(input, to) {
//     if (to === "upper") {
//         return input.toUpperCase();
//     } else {
//         return input.toLowerCase();
//     }
//^====================================================================================================
